[{"name":"alarak","tips":["Use  Discord Strike to Silence and damage your enemies, leaving them vulnerable.","Use  Telekinesis to propel yourself into range of a kill, or push yourself to safety. You can also push enemies into danger!","Lightning Surge is a great way to recover small amounts of Health as needed. Always try to hit enemies with the center of its beam for extra damage.","Deadly Charge can be channeled from the fog of war due to its huge range, allowing you to enter fights by surprise. Make sure your team is ready as you have no escape.","Make whatever choices will help you establish dominance; even if that means sacrificing some of  Sadism's bonus damage for utility options."]},{"name":"cassia","tips":["Use  Lightning Fury to poke enemy Heroes from long range, or to supplement Basic Attacks.","Cast  Blinding Light over intended targets to increase your damage, and provide self sustain via  Ring of the Leech.","Use  Fend to assist with waveclear, execute low Health enemies, or to follow up  Ball Lightning.","Use  Ball Lightning to duel enemy Heroes in melee range, or during team fights when enemies are clumped together.","Avoidance will benefit you any time you are moving, and will persist while stutter stepping.","Valkyrie is a great tool for interrupting channeled Heroic Abilities, due to its very low cooldown."]},{"name":"chromie","tips":["Sand Blast can only hit enemy Heroes, so do not be hesitant to aim it through Minion Waves and Structures.","Enemies cannot see where  Dragon's Breath is going to land. Use this to your advantage and surprise them from unexpected angles.","Time Trap freezes enemy Heroes for 3 seconds. Make sure to sync the 1-second delay of  Sand Blast and 1.5-second delay of  Dragon's Breath accordingly.","Slowing Sands is most efficient on narrow choke points.","Do not be afraid to miss  Sand Blast. It is better to cast this ability too often rather than to wait too long.","Bronze Talons is an incredibly effective talent against mobile Heroes like Tracer or Zeratul who are hard to hit with your Basic Abilities."]},{"name":"falstad","tips":["Capitalise on  Flight's global range to split push or soak Experience. It can also be used to gank.","Using  Hammerang and  Hinterland Blast against targets under crowd control will greatly improves your accuracy. Nothing beats practice, however.","Limit your offensive use of  Barrel Roll, as it leaves you vulnerable.","Use  Mighty Gust to disengage a losing battle, to split an opponent's forces in half, push your enemies into your team, or to steal capturable Objectives.||||||| .r0"]},{"name":"gall","tips":["Shadowflame is by far your highest source of damage. Use it whenever it is off-Cooldown, and take advantage of the fact that it deals its damage instantly.","Dread Orb has an extremely long range; using it against nearby Structures whenever there are no better targets is an effective way of maximising its potential.","Runic Blast requires you to be well-coordinated with your Cho partner; ask them to let you know whenver they use  Rune Bomb, or pay close attention to Cho's \"Bomb's out!\" shout.","Twisting Nether works particularly well with Cho's  Upheaval; try and use them together. Use the Ability's movement speed reduction effect to keep enemies within attack range.","Shadow Bolt Volley can be difficult to aim, especially if Cho is not prepared for it; let them know ahead of time!","Shove is extremely useful for avoiding dangerous skillshots and area of effect Abilities.","Be mindful when activating  Ogre Rage in combat, as it leaves Cho 25% less resilient than he would otherwise be."]},{"name":"genji","tips":["Set up ganks using the terrain to your advantage. Both  Swift Strike and  Cyber Agility can be cast to cross Walls and other impassable terrain.","Choose your targets wisely when playing Genji. Focus on executing low health targets using  Swift Strike to immediately gain a cooldown reset and Mana refund for this ability.","Deflect can be used to protect Genji against Structure damage while diving deep.","Genji is surprisingly Mana-hungry. Try to avoid committing to a team fight while below 25% of your total Mana.","If used from point blank range, all three  Shuriken projectiles hit the same target. However, doing so also exposes Genji to enemy counter attacks more."]},{"name":"greymane","tips":["Use Minions, Summons and Structures to trigger  Gilnean Cocktail's increased cone damage against Heroes.","Inner Beast's duration can be increased by attacking anything — not just Heroes.","Razor Swipe is useful for quickly avoiding skillshots and area of effect Abilities.","A marker appears above Heroes that would die to  Go for the Throat's damage.","Cursed Bullet is worth using against tanks early on in any given fight due to its high damage and short Cooldown."]},{"name":"guldan","tips":["Try to avoid putting Gul'dan in vulnerable situations with low Health by over using  Life Tap. Health can always be tapped for Mana, but once it has been there is no sure way of getting it back; particularly when  Drain Life is on cooldown.","Fel Flame's short cooldown allows it to be used in quick succession; take advantage of this to burn down waves of minions and your opponents.","Drain Life is most effective when cast on an enemy Hero under the effects of crowd control as it will be harder for them to escape its cast range.","Corruption is incredibly effective when cast on opponents traveling through a choke-point.","Horrify can be used to split and isolate enemy opponents. Try to target the epicenter between your target of focus and the remainder of their team.","Locate a safe position when casting  Rain of Destruction, such as behind a wall. The channeling of this ability will leave Gul'dan susceptible to crowd-control and burst damage."]},{"name":"hanzo","tips":["Use  Natural Agility as a shortcut around long walls, or to escape danger.","Use  Storm Bow to poke enemies from a safe distance.","Move back and forth to keep enemies near  Storm Bow's maximum range as it channels.","Scatter Arrow can be used to quickly dismount enemies or prevent hearthing, as it does not require channeling.","Always check bushes and vents with  Sonic Arrow or  Scatter Arrow before entering them.","Use your Heroic Abilities to follow-up your allies."]},{"name":"illidan","tips":["Dive always positions you directly behind your target; use this to body block and avoid area of effect Abilities.","Sweeping Strike does not require a target, unlike Dive, making it useful as an escape tool.","Evasion also mitigates the damage from Structures and other non-Heroic entities.","Metamorphosis's short Immaterial effect can and should optimally be used to quickly dodge Abilities.","Always use your Basic Attacks, even when out of combat, so as to heal and reduce the Cooldowns of your Abilities with  Betrayer's Thirst.","The Hunt's near-global range opens up opportunities to split push."]},{"name":"jaina","tips":["Use your Abilities together to maximise  Frostbite's damage.","Root or Slow enemies before casting  Blizzard and  Ring of Frost. Allied crowd control is also helpful.","Use Blizzard to very efficiently waveclear or claim Mercenary Camps."]},{"name":"junkrat","tips":["Be careful not to overshoot enemy targets with  Frag Launcher. Aiming just in front of the desired target (on the very edge of their hitbox) will cause the bomb to bounce into them if it does not make immediate contact.","Concussion Mine is Junkrat's primary source of self-peel. Try to not use it unwisely at the start of a fight just because it is off cooldown.","Try to set up  Steel Trap in areas of high contention just before an impending fight. The 2-second setup time makes the ability very difficult to use effectively mid-combat.","RIP-Tire's jump ability (Q) can be used to flank or cut-off unprepared enemies behind otherwise impassable terrain.","Rocket Ride often times should be used as a \"second life\" to deny enemy experience when cast just before dying; it may even allow Junkrat to pick up a kill or two!"]},{"name":"kaelthas","tips":["Since Kael'thas lacks any type of mobility, positioning is extremely important. Once an enemy Hero is attacking him, he must rely on his allies to assist him. Protect Kael'thas by being proactive and keeping a distance.","Verdant Spheres should be used with  Flamestrike when Kael'thas needs waveclear.","Gravity Lapse should only be empowered with  Verdant Spheres to catch an enemy Hero hiding behind a minion or to stun multiple enemy Heroes.","Phoenix can be used to zone enemy Heroes, kill Mercenaries, clear Minion waves, and to siege or defend Forts and Keeps. Its relatively low cooldown encourages Kael'thas to use it liberally.","Channel  Pyroblast behind walls or Kael'thas' frontline. Try to use it proactively and early in fights, rather than saving it to finish enemies off.","Gravity Lapse is difficult to hit. Take the time needed to land it, as Kael'thas is defenseless if it misses the desired target(s)."]},{"name":"kelthuzad","tips":["Generating  Master of the Cold Dark stacks is of the utmost importance early on; the faster you complete this Quest, the more likely you are to snowball.","Death and Decay should nearly always be used on-Cooldown due to its insignificant Mana cost and short Cooldown.","When targeting two Heroes,  Chains of Kel'Thuzad pulls them towards the middle point between the two Heroes.","When targeting a Hero and a Structure,  Chains of Kel'Thuzad pulls the Hero to the Structure.","Frost Nova should be used as a follow up to  Chains of Kel'Thuzad or allied crowd control.","Frost Blast can be negated through effects that render your target Invulnerable, such as  Ice Block; pick your target accordingly.","Shadow Fissure combos particularly well with a center  Frost Nova hit due to the Rooting effect."]},{"name":"kerrigan","tips":["Kerrigan should always use her Basic Abilities wisely in order to conserve Mana.","Always use  Impaling Blades and  Primal Grasp together. Use Primal Grasp to pull enemies into Impaling Blades' area-of-effect.","Primal Grasp will always pull enemies the same distance. Take this into account when placing  Impaling Blades.","Use  Siphoning Impact and  Clean Kill on enemy minions to quickly restore Kerrigan's health in lane.","Ravage can be used on enemy Structures or summoned creatures to close the gap between enemy Heroes or to retreat from a compromised position.","Kerrigan excels with allied Heroes that can follow-up on her burst damage and crowd-control, however is weak against enemy teams with a strong frontline and lots of lockdown.","Kerrigan is a fantastic early-game Hero. Take advantage of this by ganking early and often by maintaining extreme aggression.","Attempt to flank enemies whenever possible to take advantage of their poor positioning.","Enemies will usually attempt to avoid Kerrigan's  Primal Grasp/ Impaling Blades combo by side-stepping it preemptively. Use this to your advantage when pursuing them by holding onto Kerrigan's combo until her target puts themselves in a bad position, making her combo unavoidable."]},{"name":"ming","tips":["Magic Missiles should nearly always be cast on-Cooldown due to their low Cooldown and Mana cost.","Do not hesitate to cast  Arcane Orb even if you do not fully benefit from the range bonus; waiting for the perfect opportunity might cost you more overall DPS than a far hit.","Aggressively using  Teleport to secure kills is not a bad idea due to  Critical Mass and the profusion of strong Talents that affect the Ability.","Disintegrate deals less damage than your other Abilities, despite being a Heroic Ability, and should be used last in your rotation due to its long range and reliability.","Consider picking  Wave Of Force if your opponent's team composition feature strong channeled-abilities or tend to dive a specific target."]},{"name":"lunara","tips":["The fact that Lunara cannot use a mount is a both blessing and curse. In team fights, make sure to use your increased Movement Speed to kite enemy Heroes. Out of combat, do not forget about informing your allies about your position during rotations. if you are falling behind.","Leaping Strike is a great escape mechanism against hard engaging Warriors and melee Assassins like Illidan or Muradin.","Lunara's efficiency sometimes depends on the type of Support Hero the enemy team chose during draft. While she counters single target Healers like Lt. Morales or Uther, her AoE damage over time gets countered by strong AoE Healers like Stukov or Malfurion.","Lunara's  Nature's Toxin can be a great weapon against enemy stealth Heroes, since it prevents them from going invisible again."]},{"name":"malthael","tips":["Reaper's Mark can be maintained on up to 3 targets through regular Basic Attacks; spread its effects as much as possible.","Reaper's Mark's damage also works against most non-Structure units, making it effective against Bosses and Map Objectives.","You can hold the default Q hotkey to repeatedly cast  Soul Rip without effort.","Wraith Strike is useful for quickly avoiding impending skillshots and areas of effect.","A marker appears above Heroes that would die to  Last Rites's damage."]},{"name":"nova","tips":["Practice often to acquire and maintain your  Snipe accuracy. If you cannot reliably land Snipe, you cannot play Nova.","Snipe stacks fall off only if you fail to hit anything at all, including Minions, Structures, and Mercenaries.","Use  Pinning Shot to make your  Snipe and  Precision Strike much easier to land.","Holo Decoy is useful to to intercept dangerous skillshots.","An opposing Keep is nearly destroyed, but your team can't quite get to it? Try  Precision Strike."]},{"name":"ragnaros","tips":["Empower Sulfuras resets your Basic Attack; hit once, and then activate the Ability for a quick burst of damage.","Living Meteor works best against Heroes that are running in a specific direction, such as during chases or escapes.","Blast Wave can be quickly self-cast by holding ALT, and then pressing the Ability's hotkey (by default E).","Sulfuras Smash's Stunning effect can be used to setup for your own E-W-Q chain.","Lava Wave moves very slowly, but might just catch opponents that are not paying attention by surprise.","Molten Core's effect can be used to mitigate the damage of certain Map Objectives, such as on Blackheart's Bay or Sky Temple."]},{"name":"raynor","tips":["Play particularly carefully and do not overextend too far in lane while  Adrenaline Rush is on cooldown.","Hyperion is a powerful zoning tool. Use it to drive enemy Heroes away from important Map Objectives and Structures.","Giant Killer makes Raynor's powerful Basic Attacks even stronger, especially against enemy Warriors.","Inspire also works on Minions and Mercenaries. Use it during pushes to take down enemy Structures more quickly."]},{"name":"samuro","tips":["Use  Mirror Image to tank tower shots while ganking, or to damage structures without a friendly minion wave.","Critical Strike resets your Basic Attacks; activate it immediately after delivering a Basic Attack for optimal effect.","Wind Walk can be used to quickly approach enemies, or to help you escape dangerous situations.","Use  Bladestorm to kill low Health enemies who may otherwise be protected by crowd control provided by thier allies.","The Movement Speed provided by  Image Transmission can be used not only to chase, but to dodge or to disengage from combat as well.","Activate  Image Transmission to engage on a Hero near one of your Images, or to return to safety when you are in danger."]},{"name":"thebutcher","tips":["Butcher's Brand should be used wisely, as it is The Butcher's only source of survivability. Do not use it as a source of damage.","The Butcher can target enemy minions or mercenaries with  Ruthless Onslaught to escape enemy Heroes.","Ruthless Onslaught should be used primarily as a gap-closer, rather than as damage or crowd control.","Ruthless Onslaught makes The Butcher Unstoppable while charging. If timed correctly, he can avoid or negate key enemy abilities.","Accumulate as much  Fresh Meat as possible, but not at the expense of missing team fights or Battleground objectives.","Cast  Furnace Blast early so that it explodes just as The Butcher reaches his target, giving the enemy team less time to react.","Do not use  Lamb to the Slaughter on Heroes that have abilities that can easily remove the chain.","Roam as much as possible early in the match. This will help The Butcher quickly accumulate stacks of  Fresh Meat."]},{"name":"thrall","tips":["Thrall is a very powerful solo-laner, who thrives in one-versus-one situations.","Play very carefully against Heroes that can blind you. Also, refrain from using  Windfury while blinded.","Windfury can be used as a gap-closer or as an escape mechanism.","Earthquake synergizes very well with other AoE based abilities, such as Diablo's  Apocalypse or Jaina's Ring of Frost","Sundering is one of the strongest and most reliable abilities to interrupt channeled Heroic Abilities like E.T.C.'s  Mosh Pit or Li Li's  Jug of 1,000 Cups."]},{"name":"tracer","tips":["Use  Blink to close distance on enemies, dodge Abilities, or escape danger.","If you have not already, set Blink's Quick Cast to \"on\" (under Settings, Hotkeys, Quick Cast Setting). This will make the Ability much more responsive, which will help you to avoid skillshots with it.","Use  Melee to deal burst damage to enemy Heroes and quickly charge  Pulse Bomb. Melee can also be used to assist with waveclear as needed.","Tracer can safely \"overextend\" thanks to  Recall. Use this to kill low Health enemies, who may be too dangerous to reach for your allies.","Activate Recall to remove negative effects before other enemy Heroes are able to follow-up with Silences or Stuns.","Use Tracer's extremely high attack speed from  Reload to quickly clear units that do not have Health, but take a certain number of Basic Attacks. Examples include Doubloon Chests,  Cocoon, and  Scouting Drone."]},{"name":"tychus","tips":["Tychus cannot stutter-step, so use  Overkill when you want to deal sustained AoE damage while moving.","Use  Frag Grenade to displace enemies that you are fleeing from or chasing, or to interupt channeled Abilities. Can be used during Overkill.","Use  Run and Gun to escape death, dodge harmful Abilities, or secure kills.","Activate  Minigun when attacking a Hero with a large Health pool, or who has been Stunned or Rooted.","Use  Commandeer Odin just as a fight begins, when the enemy team cannot just run away from it.","Place the  Drakken Laser Drill off to the side of a fight so that it will not be destroyed immediately."]},{"name":"valeera","tips":["The Unrevealable portion of  Vanish may be used mid-fight to trick enemies with new positioning.","Do not hesitate to use  Sinister Strike to dodge powerful enemy skillshots or even to disengage from a losing fight.","When possible, try to hit multiple enemy Heroes with a single cast of  Blade Flurry as to generate bonus Combo Points.","Resist the temptation to use  Cheap Shot on enemies who are already locked down or have a small chance of getting away, as the damage it generates is very low compared to its alternatives.","Try to use  Eviscerate when 3 Combo Points are available to maximize its damage output.","The Silence portion of  Garrote can be used to interrupt an enemy's channeled ability.","Try to not use  Smoke Bomb near enemies who can easily leave its AoE, as this will render the ability completely useless.","Do not be afraid to use  Cloak of Shadows liberally, as the cooldown is rather short for a Heroic Ability."]},{"name":"valla","tips":["Hatred empowers Valla's Basic Attacks and increases her movement speed; try and attack something at least once every 5 seconds so that your stacks do not fall off.","Hungering Arrow has a high Mana cost and will home unto undesirable targets, such as Minions and Summons; avoid using the Ability unless it is going to deal useful damage.","Multishot is your main waveclearing tool. Its wide area of effect also makes it excellent for checking hidden areas, revealing Stealthed Heroes, and dismounting opponents.","Vault can be used offensively, as a gap-closer, and defensively, to create space between yourself and opponents and dodge Abilities. Limit your offensive use of the Ability, as it leaves you vulnerable.","Strafe's reliability goes up as opponents use up their crowd control Abilities; keep track of their Cooldowns, and remain on the move so as to minimise the chance you will be interrupted.","Rain of Vengeance is better used as a follow-up or as a self-peeling tool than merely for dealing damage."]},{"name":"varian","tips":["When playing the Arms Build, always make sure to use  Colossus Smash first in order to increase all damage dealt from your other abilities.","If you plan on going for  Twin Blades of Fury at Level 10, we strongly recommend also picking  Second Wind at Level 7 in order to be able to clear Mercenary and Boss Camps all by yourself.","Charge does not go through obstacles such as Walls, Gates, or any other impassable terrain.","If you are not sure which Banner to pick at Level 16, the safest bet is usually  Banner of Ironforge.","Taunt can be used to interrupt (Heroic) abilities that have a short channel animation, such as  Sundering,  Storm, Earth, Fire, or  Twilight Dream.","Playing Varian requires you to be mindful of your allies, especially during the initial Hero draft. For instance, if your team desperately needs a Tank, do not insist on taking  Colossus Smash or  Twin Blades of Fury at Level 10.","Shattering Throw completely shuts down Heroes like Artanis,Johanna, orChen."]},{"name":"zeratul","tips":["Cleave is excellent at clearing large Minion waves and Mercenary Camps.","Singularity Spike provides a massive slowing effect; use it to deliver several Basic Attacks against your target.","Blink is your main survival tool; only initiate combat with it when it is safe to do so.","Use  Void Prison to setup combos with your allies by hitting several enemy Heroes, or to split the enemy team in half.","Permanent Cloak does not make you Invisible; merely translucent. Keen players will see you coming. To become truly Invisible, stand still for 1.5 seconds."]},{"name":"zuljin","tips":["The damage caused to Zul'jin by activating  Berserker can be used to help him attain his bonus attack speed much faster, however try to never abuse Berserker to the point of leaving Zul'jin with low health in a potentially compromising position.","Grievous Throw will only strike and mark the first two enemies it comes into contact with. When intending to hit an enemy Hero, Zul'jin should avoid casting Grievous Throw at Heroes buried behind enemy minions, mercenaries, or structures.","Because  Twin Cleave always travels the same distance in a circular motion, Zul'jin can cast it at an angle to strike enemies close to him who would otherwise avoid its pathing.","Make sure to find a safe stop to take cover before channeling  Regeneration as damage will interrupt it's effect (this includes aggro on those pesky lane minions!)","Although Zul'jin will get the most value from casting  Taz'dingo! at low Health, it may sometimes be a wiser play to cast Taz'dingo preemptively to avoid enemy ability combos that would otherwise result in certain death.","There is a slight delay when casting  Guillotine, therefore Zul'jin should keep an eye the target's movement path and aim the ability accordingly."]},{"name":"anubarak","tips":["Exploit  Scarab Host Beetles to soak damage from Structures and Mercenaries, and to intercept skillshots.","Use  Burrow Charge to close up on a target, then follow up with  Impale for much crowd control.","Harden Carapace should be used on-Cooldown during fights due to its low Mana cost, and ability to summon Beetles.","Use  Locust Swarm with caution; it heals for a large amount, but does not make you invincible, especially versus burst damage.","Hold onto your  Cocoon's Cooldown to interrupt and deny strong enemy Heroic Abilities."]},{"name":"artanis","tips":["Use  Blade Dash to finish off enemies and to reduce the cooldown of  Shield Overload with early talents.","Always use  Twin Blades when it is available.","Try to hit backline enemies with  Phase Prism while  Blade Dash is active.","Phase Prism can be used as a disengage mechanism if it hits an enemy Hero blocking your escape path.","Use  Suppression Pulse just as you enter a large team fight to reduce the damage that you will take.","Use  Purifier Beam on your low mobility targets, since they lack the means to escape it easily.","Constantly use Basic Attacks, especially  Twin Blades, to reduce  Shield Overload's cooldown."]},{"name":"arthas","tips":["Arthas passively takes 15% less damage from Basic Attacks, which makes him a great pick against Heroes like Illidan or Valla.","Pressing ALT + Q causes Arthas to quickly cast  Death Coil on himself, healing him for a considerable amount.","When using  Howling Blast, it is sometimes better to cast it slightly ahead of the enemy target's movement path, as its projectile travels rather slowly.","Summon Sindragosa disables enemy Structures, which makes it a very potent ability to use during pushes.","Frozen Tempest is a very useful tool to get rid of Zagara's  Creep Tumor."]},{"name":"blaze","tips":["Flame Stream actually fires two parallel projectiles; hit with both to double the Ability's damage.","An Ignited  Oil Spill will ignite any other Oil Spill that overlaps with it.","Jet Propulsion does not collide with Minions, allowing you to charge through to hit enemy Heroes.","You do not have to stay inside  Bunker Drop; press the R key to leave it.","Combustion prevents you from casting other Abilities while it is being channeled.","The Cooldown of  Pyromania is reduced for each Hero hit by  Flame Stream; double hits count as well."]},{"name":"chen","tips":["Due to the way his ressource, \"Brew\", and his abilities work, Chen has an ideal skill rotation, meaning you should use abilities in a fix sequence in order to increase their efficiency:  Flying Kick →  Keg Smash →  Breath of Fire →  Fortifying Brew.","Flying Kick can be used on enemy Structures as well, which makes it a great ability to leap over Walls, Forts, or Towers.","Remember that  Keg Smash can also be used defensively to slow down engaging enemies.","When  Storm, Earth, Fire expires, Chen returns to pre-cast health value. If all three Spirits die, so does Chen."]},{"name":"cho","tips":["Surging Fist can be interrupted; be careful when casting it near opponents with crowd control.","Consuming Blaze heals for each enemy hit; hit as many as possible with the Ability, and then try and attack an ignited target to gain even more healing.","Rune Bomb's slow travel time makes it much more effective at short range. Be sure to call out your cast for Gall to detonate the bomb.","Upheaval has a short cast time, and pulls opponents behind your position; be sure to account for these factors.","Hammer of Twilight is an excellent tool for quickly interrupting opponents.","Ogre Hide should be active whenever you are about to take a significant amount of damage."]},{"name":"dehaka","tips":["Use  Dark Swarm to walk through enemies or teammates who are in your way; however, be mindful that you cannot body-block enemies while it is active.","Drag enemies out of position, under your turrets, or into the Abilities of your allies.","Maximize your map presence by evaluating options for  Brushstalker before it is off cooldown.","Try to have  Essence Collection full and available for team fights. For healing outside of team fights you can fountain or hearthstone; use Brushstalker to get back into action quickly.","Use  Isolation on key assassins or supports to get the most out of it.","Activate  Adaptation as soon as you are being focused by the enemy team; cast Burrow if you will otherwise die before Adaptation heals."]},{"name":"diablo","tips":["Remember that after reviving through  Black Soulstone, your Health pool will be 40% smaller.","Use  Overpower right after  Shadow Charge to unconditionally move opponents towards your teammates.","Cast  Lightning Breath when you suspect you may be the target of a crowd control chain, as it makes you Unstoppable for the duration.","Use  Apocalypse as a follow-up or counter-initiation tool to improve your chances of hitting many opponents."]},{"name":"va","tips":["Boosters can be used to both initiate onto enemies or peel them away from vulnerable allies.","Remember that  Defense Matrix only affects enemy Heroes and will not reduce the damage of enemy Minions, Mercenaries, or Bosses.","Many times it will be worth saving  Defense Matrix for the enemy Assassins; this will provide D'Va's team with maximum damage mitigation.","When possible,  Self-Destruct should be used in conjunction with AoE crowd-control so that enemies will not be able to flee its damage radius.","Bunny Hop can be used defensively to avoid being locked down by the enemies' otherwise devastating crowd-control.","Try to strike multiple enemies with each cast of  Big Shot in order to reduce the cooldown of  Call Mech as quickly as possible."]},{"name":"","tips":["Use  Powerslide along with  Face Melt to easily push opponents towards or away from your teammates.","Make the best out of  Rockstar's Armor by using  Guitar Solo whenever you are being attacked.","Capitalise on  Stage Dive's global range to split push or soak Experience.","Keep track of enemy crowd control so that  Mosh Pit is not interrupted."]},{"name":"garrosh","tips":["Armor Up gives Garrosh an impressive amount of damage mitigation while at low Health, allowing him to stay in combat longer than most other Heroes.","Groundbreaker can be used to pull an enemy Hero out of position towards Garrosh before throwing them into his allies with  Wrecking Ball.","Bloodthirst's self-sustain is most effective after Garrosh has suffered damage as it heals for a percentage of his missing Health.","Remember that  Wrecking Ball is not a targeted ability and will always throw the enemy closest to Garrosh when cast (including Minions and Mercenaries).","Due to the small radius of  Warlord's Challenge, it will sometimes be difficult to strike multiple Heroes with the ability. It will often times be worth using Warlord's Challenge on a single Hero should it help secure a kill and ensure a numbers advantage for Garrosh's team.","The low cooldown of  Decimate allows Garrosh to use the ability quite often, especially when needing to waveclear a pushed in Minion wave."]},{"name":"johanna","tips":["Damage and Slow adjacent enemies with  Punish.","Condemn can interrupt abilities like Muradin's  Dwarf Toss or E.T.C.'s  Mosh Pit.","Shield Glare enemies that deal significant Basic Attack damage.","Use  Blessed Shield to engage, buy time to flee, or to interrupt enemies that are channelling abilities.","Use  Iron Skin just prior to an enemy using crowd control on you."]},{"name":"leoric","tips":["Leoric is a powerful solo-laner. Use your strong Basic Attacks and your self-sustain to your advantage.","Do not be afraid to sacrifice your life if this means your team gets an important Objective in return.","Due to their high health pool,  Drain Hope is particularly effective if used on enemy Warriors.","Wraith Walk allows you to walk through enemy Gates.","Trade your life when it saves one or even several of your teammates, since  Undying causes you to resurrect faster than them.","You can still use your Hearthstone while in  Undying form."]},{"name":"muradin","tips":["Stoneform should always be used during  Avatar to increase its efficiency.","Thunder Clap is crucial to shut down nimble Assassins like Illidan or Valla.","Thunder Burn has incredible synergy with  Healing Static, as the second explosion causes to heal Muradin as well.","Although Muradin is a great initiator, it is sometimes necessary to use  Storm Bolt defensively in order protect your backline from engaging enemy Heroes."]},{"name":"rexxar","tips":["Rexxar's kit is one of the most challenging to master. Thus, we strongly recommend practising Misha's controls against the A.I. first before playing Rexxar in Hero and Team League.","Due to his strong laning presence on maps like Braxis Holdout or Dragon Shire, Rexxar should usually be sent to a solo lane.","Easy Prey provides Rexxar with powerful waveclear. Use it to quickly push lanes and clear Mercenary Camps.","Do not forget that you can still control Misha while  Feign Death is active.","If you went for  Animal Husbandry make sure to play even more carefully than you normally would, as a single death causes you to lose all the bonus health you accumulated to that point.","Misha can be an excellent tool to intercept enemy abilities that were originally aimed at Rexxar."]},{"name":"sonya","tips":["As  Fury does not decay over time, try and keep it full before impending engagements.","Ancient Spear is Sonya's most important Ability; avoid wasting it unless you are sure you can land it.","Use  Whirlwind to trigger  Fury's movement speed when chasing foes down to keep up with them.","Try and constantly keep on attacking while under the effects of  Wrath of the Berserker to maintain its effects for as long as possible."]},{"name":"stitches","tips":["Vile Gas hits nearby enemies when triggered; position yourself to maximise this effect when it is safe to do so.","Hook can be used to pull enemy Heroes away from safety, or to pull your allies out of danger.","Slam is a great tool for dismounting enemy Heroes at range, and is also suitable for use on Minion waves.","Devour should be used to recover health as needed, or to deal bonus damage to non-Heroic units.","Putrid Bile can be used bile to slow escaping enemies, or to disengage.","Gorge can be used to bring enemy Heroes behind your gate and walls, resulting in easy kills."]},{"name":"tyrael","tips":["Use your abilities wisely while laning. If you are not careful, Tyrael will run out of Mana very quickly.","Since Tyrael is not as durable as other Tanks, make sure to use his outstanding mobility to mitigate damage by dodging abilities.","El'druin's Might can be used to juke opponents while Tyrael is on the retreat.","If you play with  Sanctification, save it for the enemy team's most dangerious abilities and track their cooldowns accordingly.","Tyrael's  Holy Ground can steal Mercenary and Boss Camps if its projectile is aimed at the very center of the capture platform."]},{"name":"zarya","tips":["Use  Shield Ally as frequently as possible. Try to anticipate which ally is about to get focused to maximise your Energy gain.","Personal Barrier can be used to absorb damage from Structures in order to quickly fill your Energy level.","Expulsion Zone's low cooldown makes it a valuable zoning tool to both engage and disengage from the enemy.","Unlike other Warriors, Zarya lacks mobility. Thus, keeping a healthy distance to the enemy team is usually recommended.","Zarya's Basic Attacks hit all enemies in a straight line. Utilize this to your advantage when clearing Minion waves or Mercenary Camps.","Zarya should never be the only Warrior in your team. If none of your teammates drafted a Warrior, we do not recommend picking Zarya."]},{"name":"alexstrasza","tips":["Dragonqueen's duration does not get affected by using  Cleansing Flame, which means you can use the Heroic Ability and come back in Dragon Form for the remainder of Dragonqueen's duration.","Dragonqueen should be treated like a Heroic Ability. Make sure to use it during important team fights exclusively and do not waste the long cooldown during skirmishes and duels.","Wing Buffet, which can be used during  Dragonqueen, is an excellent disengage ability. Use it when opposing Warriors and melee Assassins are threatening your backline.","Cleansing Flame is an incredibly versatile Heroic Ability. Keep in mind that it can also be used as an escape mechanism while surrounded by multiple enemies.","Draft wise, Alexstrasza can fulfill the role of either a main Support or a second Support."]},{"name":"ana","tips":["Ana's talent tree is very situational. For instance, if the enemy team composition features lots of Slowing effects, choose  Purifying Darts, whereas  Smelling Salts excels against Stun heavy Heroes.","Due to her limited self-healing capabilities, Ana needs to pay special attention on where she positions herself during a team fight.","Nano Boost's duration of 8 seconds is quite long, so do not be too hesitant to cast it at the beginning of a team fight.","Use Ana's superior Basic Attack range to consistently harass opponents in lane."]},{"name":"auriel","tips":["Sacred Sweep gives you good waveclear, and decent damage in team fights. Use it to build up Energy whenever it is available.","Try to get the most value out of your Energy by casting  Ray of Heaven on multiple allies.","Detainment Strike can be a great tool to setup kills in tight corridors; however, don't hesitate to use it just to peel pursuing enemies.","Be aware of your allies and move  Bestow Hope to an ally who is positioning to deal damage.","Like other Stasis effects,  Crystal Aegis can be used to save allies from targeted Abilities."]},{"name":"brightwing","tips":["Phase Shift allows Brightwing to split-soak experience very efficiently while also allowing her to join team fights in time.","Blink Heal can be used to juke enemy Heroes and abilities.","Arcane Flare's casting range is larger than the shooting range of enemy Towers, Forts, and Keeps.","Pixie Dust becomes a crucial ability against Assassins like Jaina or Kael'thas to reduce their spell damage potential."]},{"name":"kharazim","tips":["Radiant Dash can be used on your Elemental Allies (even over Walls and other unpassable terrain) in order to escape pursuing enemies.","Avoid smashing your Q-button too quickly when playing Kharazim, as it may cause  Radiant Dash to use both charges on the same target.","Do not use any healing or shielding abilities on the target you used  Divine Palm on.","During team fights, especially in the later stages of the game, it is often better to use  Radiant Dash on allies in order to heal them and reposition yourself.","Echo of Heaven is a powerful talent to improve your healing numbers. However, the second heal does not grant the bonus movement speed provided by  Breath of Heaven.","It is incredibly important to wait for the right moment before you use  Seven-Sided Strike. Ideally, you want to focus its damage on one enemy only to unfold all its damage on the same target."]},{"name":"lili","tips":["Use  Healing Brew whenever it is available to heal allies.","Cloud Serpent should be used on frontline melee Heroes when possible.","Use  Blinding Wind to Blind Heroes; avoid liberal PvE use.","Activate  Jug of 1,000 Cups preemptively in team fights."]},{"name":"morales","tips":["Healing Beam still heals Lt. Morales even if the healed target is currently at full health.","Do not be hesitant to use  Healing Beam on Minions or Mercenaries when no allied Heroes are nearby in order to keep up the self-healing effect.","When healing a frontliner, notably Warriors and Melee Assassins, try to synchronise your movement with theirs to avoid getting in front of them. This prevents you from exposing yourself to the enemy team.","Medivac Dropship can be a great Heroic Ability if you play Team League as a premade team, however, it usually performs rather poorly if you play Hero League or Quick Match.","Make sure to use  Stim Drone on Assassins like Illidan, Raynor, or Valla, since Heroes who rely on their Basic Attacks benefit most of it.","If the enemy team has several Warriors and melee Assassins who can threaten you, casting  Medivac Dropship and navigating it to a nearby location while they are attacking you can save your life."]},{"name":"cio","tips":["Frequently switch between  Crossfade - Healing Boost and  Crossfade - Speed Boost according to the situation you find yourself in.","When an ally is chased by enemies,  Crossfade - Speed Boost is the better choice to guarantee their survival.","If the enemy team composition features multiple sources of Stuns and Silences,  Back in the Mix at Level 16 becomes a very useful talent.","While chasing or retreating, make sure to use Lucio's  Wall Ride Trait to your advantage, as it provides a 20% Movement Speed bonus.","While rotating from one lane to another, combine  Amp It Up and  Crossfade - Speed Boost."]},{"name":"malfurion","tips":["Innervate on Mana-hungry Heroes, notably, casters such as Kael'thas or Jaina, who can not function without Mana.","Keep  Regrowth up on as many targets as possible, even if they are at full Health.","Moonfire is useful for quickly checking Bushes, dismounting or revealing opponents, and clearing Zagara's Creep Tumors.","Entangling Roots is much easier to land on targets that have already been crowd controlled.","Keep your  Tranquility for heated team fights, where several teammates may require healing.","Twilight Dream is an excellent counter-initiating tool, especially against multiple melee Heroes."]},{"name":"rehgar","tips":["Rehgar is surprisingly good at clearing Mercenary Camps all by himself.","Using  Ghost Wolf's empowered Basic Attacks while fighting enemy Heroes or clearing Mercenary Camps increases your damage output significantly.","It is better to cast  Ancestral Healing too early than too late. The more the enemy focuses on killing a single target of your team, the earlier you should cast Ancestral Healing on them.","Lightning Shield can be cast on  Earthbind Totem to damage Minion waves from a safe distance."]},{"name":"stukov","tips":["Use  Bio-Kill Switch primarily to heal allies affected by  Healing Pathogen.","Cast  Healing Pathogen onto Heroes who will spread it to as many allies as possible.","Weighted Pustule is useful for harassment and light disengage. It can also secure kills on fleeing enemies.","Channel  Lurking Arm onto choke points, or use it to cancel channeled enemy Heroics.","Massive Shove can be used to push enemies far away from team fights, or simply to Stun them against nearby terrain."]},{"name":"tassadar","tips":["Using  Oracle causes Tassadar to dismount. If possible, make sure to use it first and mount up after.","Tassadar is a formidable solo laner. Try to harass your opponents with basic attacks by using  Plasma Shield on yourself as soon as you notice your enemy fights back.","Plasma Shield can be used on allied Structures. Use this to buy your team more time while defending.","If your team is retreating, remember that  Psionic Storm can be used to dismount pursuing enemies."]},{"name":"tyrande","tips":["Use  Sentinel as frequently as possible. The vision it provides helps your team in making better decisions.","Always mind your positioning when playing Tyrande. If caught by surprise, she is one of the easiest Heroes to get taken down.","Shadowstalk is an incredibly versatile Heroic Ability. Use it to ambush the enemy team or to cover your retreat.","Landing  Lunar Flare on moving targets requires practise and experience. Try to anticipate their movement paths and aim accordingly.","Hunter's Mark can be used on non-Heroic targets, such as Bosses, Immortals, or Punishers, in order to kill them faster."]},{"name":"uther","tips":["Holy Light is expensive and has a long Cooldown; use it sparingly, and against targets currently being focused down.","Holy Radiance is an effective way of applying  Devotion's Armor-granting effect to several allies at once, including oneself.","Use  Hammer of Justice against high-priority targets that must be crowd controlled or have crowd control on them that is about to expire.","Divine Shield has broadly different offensive and defensive uses; pay attention to your enemy's and your own team compositions to find out who the aggressor should be.","Divine Storm should be used along  Hammer of Justice to lock down key targets for an extended period of time. Space out using the two Abilities to make the most out of their stun duration.","Death is not the end for Uther; remember to use  Devotion to heal allies even after falling in battle yourself. Your sacrifice may even be worthwhile should you be out of Mana..."]},{"name":"abathur","tips":["Symbiote can be used to absorb the XP from distant lanes and to assist your allies in combat.","Place  Toxic Nests around the map to provide vision, deal damage, and dismount enemies who are rotating.","Ultimate Evolution's low cooldown allows you to use it liberally in team fights, to destroy Structures, or speed up the capture of Mercenary Camps.","Spawn  Locust Strain in a lane that needs your assistance or your team is pushing hard in.","Use  Deep Tunnel to quickly traverse the map and get out of harm's way."]},{"name":"azmodan","tips":["Cast  General of Hell whenever it is available; prioritise empty lanes with plenty of Minions, as the Ability has global range.","Let your allies know that you intend on stacking up  Taste for Blood so that they may help you.","Summon Demon Warrior is very strong early on in terms of raw damage output; later on, it is mostly useful for scouting.","Keep track of enemy crowd control so that  All Shall Burn is not interrupted.","Hold the ALT key to self-cast  Black Pool."]},{"name":"gazlowe","tips":["Always collect your Scraps with  Break it Down! when your  Rock-It! Turrets have outlived their usefulness.","Use  Rock-It! Turret to soak damage from Structures and Mercenaries, as needed.","Avoid casting  Deth Lazor when enemies are nearby, as it leaves you vulnerable.","Combo  Grav-O-Bomb 3000 and  Xplodium Charge together for a powerful AoE crowd control effect."]},{"name":"medivh","tips":["Make sure to hit an enemy Hero when using  Arcane Rift. This will drastically reduce its cooldown.","Medivh's  Raven Form is an incredibly efficient scouting tool. Use it as much as possible to reveal the enemy team's position.","As useful as  Raven Form is, do not stray too far from your team, since they might require your help if ambushed or ganked by the opponents.","Force of Will is very effective if used on melee Assassins like Illidan, Thrall, or The Butcher. If there is no melee Assassin in your team composition, Warriors (especially while they are engaging the enemy team) should be the main target for this ability.","Medivh cannot be targeted by enemy Structures while in  Raven Form, so make sure to provide your team with valuable vision information while pushing and sieging.","Keep in mind that  Portal can be used both offensively and defensively. Depending on the situation it is a formidable ability to either help allies engage or retreat."]},{"name":"murky","tips":["Hide your  Spawn Egg in nooks and crannies, Bushes, or near allied Structures so that it is difficult to find.","Use  Slime and  Pufferfish to efficiently waveclear at all stages of the game.","Standing on top of Pufferfish will prevent opponents from targeting it easily.","Try and dodge dangerous skillshots or area of effect Abilities with  Safety Bubble.","Call out your intended  Octo-Grab target so that your teammates know just who to focus down."]},{"name":"nazeebo","tips":["Corpse Spiders are your main source of damage, throw them in the middle of the enemy team.","Zombie Wall should be used purely for its utility, use it sparingly. It can also be used to attract Forts and Keeps when no friendly Minions are nearby.","Plague of Toads can be difficult to hit, use it on enemies coming towards you.","Gargantuan allows you to stay mobile while dealing plenty of damage at the same time.","Ravenous Spirit can kill entire enemy teams if you can channel it uninterrupted. Make sure to cast it from a location that is hard to reach for the enemies.","IMPORTANT: Poison Minions before killing them to increase your health and Mana with  Voodoo Ritual. We strongly recommend trying to reach 175 stacks before Level 20 in order to get the significant late game power spike from  Vile Infection."]},{"name":"probius","tips":["Unlike mounts,  Worker Rush may be used in combat. Keep in mind that ALL damage (including damage-over-time such as poisons) will immediately break the effect.","Place Pylons from  Warp In Pylon within brush or behind terrain or allied fortification to protect them from being immediately destroyed.","Do not be afraid to poke enemies with  Disruption Pulse when unable to set up or waiting on the cooldown of  Warp Rift.","Warp Rift is most effective when used in narrow corridors and chokepoints that force enemies to travel through its AoE.","Photon Cannon is great for zoning as well as soaking damage from Minions, Mercenaries, and enemy structures.","Save  Pylon Overcharge for teamfights surrounding important Battleground objectives. This will force the enemy to either stay within its range or give up the objective to disengage, either of which are good for Probius and his allies.","Instead of simply placing  Null Gate across a pathway to block it off, Null Gate can be angled slightly (depending on the space) to maximize the distance an enemy will be forced to travel through it."]},{"name":"hammer","tips":["Be careful with  Siege Mode; although its damage increase may be tempting, it also leaves you very vulnerable to area of effect Abilities.","Use  Thrusters sparingly; they are your only reliable method of escaping opponents.","Sgt. Hammer's low Mana costs allow you to use  Spider Mines on-Cooldown to protect your flanks. Keep them away from Minions to preserve them.","Concussive Blast deals very little damage; use it to push enemies away from you or teammates.","Neosteel Plating should be used to avoid Ability-based burst damage such as an impending  Pyroblast hit.","Napalm Strike is useful for quickly checking Brushes, dismounting or Revealing opponents, and clearing Zagara's Creep Tumors."]},{"name":"sylvanas","tips":["Use all of your  Withering Fire stacks freely; they cost no Mana and refresh quickly.","Use  Shadow Dagger whenever it is available, but see to have it affect as many enemies as possible.","Haunting Wave should almost exclusively be used only for its mobility, as it deals minimal damage.","Hold on to  Wailing Arrow until you can hit many opponents or for when you need to prevent a Hero from saving another.","Use  Mind Control to move a key target away from their team, and into yours.","Black Arrows allows you to push down Structures without minions; exploit this especially with allies."]},{"name":"thelostvikings","tips":["Unless there is a threat of immediate danger, always make a point of picking up Regeneration Globes from each minion wave so as to increase your stacks of  Viking Hoard.","Spin To Win! is great for individual waveclear in lane, and can be used in team fights by all three Vikings on the same target(s) to inflict massive compounded damage.","If  Norse Force! is selected in place of Spin To Win!, try and use it only when taking large amounts of damage.","Jump! should be used preemptively when life threatening damage is perceived imminent.","Viking Bribery should stack very quickly, however timing and objective location needs to be factored in when capturing Mercenaries in order to attain the most effectiveness from their presence.","Play Again! is phenomenal for map control and should mostly be used offensively throughout the map, rather than trying to recover from the loss of a Viking or two.","Longboat Raid! should be used primarily in objective-based team fights, with  Mortar being cast on the target of focus."]},{"name":"xul","tips":["Thanks to the strong waveclear provided by  Cursed Strikes, Xul should normally rotate between several lanes in order to raise as many Skeletons as possible.","Xul has limited mobility and escape mechanisms during team fights, which is why he should usually engage after one or both Warriors.","We usually do not recommend picking Xul on 2-lane maps, since rotating between lanes becomes quite difficult. Braxis Holdout can be an exception to this rule, as it requires lots of waveclear which Xul has plenty of.","If available,  Skeletal Mages can be used to lock down targets in the enemy team's backline allowing your teammates to follow up quite easily."]},{"name":"zagara","tips":["Baneling Barrage should be used primarily for waveclear as to conserve valuable mana.","Use  Hunter Killer to zone enemies from team fights or lane.","Always use  Infested Drop when it is available to deal damage safely and provide vision. Infested Drop can also be used to tank Mercenary Camps and interrupt channeling of objectives (like Tributes on Cursed Hollow).","Do not try to force  Devouring Maw and instead wait for enemies to come into range.","Place Nydus Worms provided by  Nydus Network in spots clear of heavy foot-traffic as to prevent them from being immediately destroyed.","Always use all available  Creep Tumors. Place them inside bushes and at other out-of-the-way locations to prevent the enemy from accidentally destroying them with AoE abilities."]}]